; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v6 ?v13)
             (pred_5 ?v3 ?v7)
             (pred_11 ?v6 ?v7)
             (pred_6 ?v12 ?v6 )
	     (pred_10 ?v6)
             (pred_7 ?v8)
             (pred_1 ?v3)
             (pred_3 ?v7)
             (pred_9 ?v6)
             (pred_2 ?v3)
             (pred_8 ?v6)
             (pred_4 ))



(:action op_3
:parameters (?v1 ?v9 ?v5 ?v2)
:precondition (and (pred_7 ?v1) (pred_7 ?v9) (pred_1 ?v5) (pred_3 ?v2)
          (pred_12 ?v1 ?v9) (pred_5 ?v5 ?v2)
                   (pred_11 ?v9 ?v2) (pred_10 ?v1) 
                   (pred_9 ?v9) (pred_2 ?v5))
:effect (and  (pred_8 ?v9) (not (pred_9 ?v9))))


(:action op_1
:parameters (?v1 ?v10)
:precondition (and (pred_7 ?v1) (pred_7 ?v10)
               (pred_10 ?v1) (pred_12 ?v1 ?v10) (pred_8 ?v10))
:effect (and (pred_10 ?v10) (not (pred_10 ?v1))))

(:action op_2
:parameters (?v1 ?v5)
:precondition (and (pred_7 ?v1) (pred_1 ?v5) 
                  (pred_10 ?v1) (pred_6 ?v5 ?v1) (pred_4 ))
:effect (and (pred_2 ?v5)
   (not (pred_6 ?v5 ?v1)) (not (pred_4 ))))


(:action op_5
:parameters (?v1 ?v4 ?v11)
:precondition (and (pred_7 ?v1) (pred_1 ?v4) (pred_1 ?v11)
                  (pred_10 ?v1) (pred_2 ?v11) (pred_6 ?v4 ?v1))
:effect (and (pred_2 ?v4) (pred_6 ?v11 ?v1)
        (not (pred_2 ?v11)) (not (pred_6 ?v4 ?v1))))

(:action op_4
:parameters (?v1 ?v5)
:precondition (and (pred_7 ?v1) (pred_1 ?v5) 
                  (pred_10 ?v1) (pred_2 ?v5))
:effect (and (pred_4 ) (pred_6 ?v5 ?v1) (not (pred_2 ?v5)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_20 obj_17 obj_12 obj_02 obj_10 obj_16 obj_15 obj_06 obj_09 obj_19 obj_01 obj_13 obj_08 obj_07 obj_03 obj_05
    obj_11 obj_04
    obj_14 obj_18
    )

    (:init
       (pred_4)

       (pred_7 obj_20)
       (pred_7 obj_17)
       (pred_7 obj_12)
       (pred_7 obj_02)
       (pred_7 obj_10)
       (pred_7 obj_16)
       (pred_7 obj_15)
       (pred_7 obj_06)
       (pred_7 obj_09)
       (pred_7 obj_19)
       (pred_7 obj_01)
       (pred_7 obj_13)
       (pred_7 obj_08)
       (pred_7 obj_07)
       (pred_7 obj_03)
       (pred_7 obj_05)
       (pred_3 obj_11)
       (pred_3 obj_04)
       (pred_1 obj_14)
       (pred_1 obj_18)

       (pred_12 obj_20 obj_10)
       (pred_12 obj_20 obj_17)
       (pred_12 obj_17 obj_16)
       (pred_12 obj_17 obj_12)
       (pred_12 obj_17 obj_20)
       (pred_12 obj_12 obj_15)
       (pred_12 obj_12 obj_02)
       (pred_12 obj_12 obj_17)
       (pred_12 obj_02 obj_06)
       (pred_12 obj_02 obj_12)
       (pred_12 obj_10 obj_09)
       (pred_12 obj_10 obj_16)
       (pred_12 obj_10 obj_20)
       (pred_12 obj_16 obj_19)
       (pred_12 obj_16 obj_15)
       (pred_12 obj_16 obj_17)
       (pred_12 obj_16 obj_10)
       (pred_12 obj_15 obj_01)
       (pred_12 obj_15 obj_06)
       (pred_12 obj_15 obj_12)
       (pred_12 obj_15 obj_16)
       (pred_12 obj_06 obj_13)
       (pred_12 obj_06 obj_02)
       (pred_12 obj_06 obj_15)
       (pred_12 obj_09 obj_08)
       (pred_12 obj_09 obj_19)
       (pred_12 obj_09 obj_10)
       (pred_12 obj_19 obj_07)
       (pred_12 obj_19 obj_01)
       (pred_12 obj_19 obj_16)
       (pred_12 obj_19 obj_09)
       (pred_12 obj_01 obj_03)
       (pred_12 obj_01 obj_13)
       (pred_12 obj_01 obj_15)
       (pred_12 obj_01 obj_19)
       (pred_12 obj_13 obj_05)
       (pred_12 obj_13 obj_06)
       (pred_12 obj_13 obj_01)
       (pred_12 obj_08 obj_07)
       (pred_12 obj_08 obj_09)
       (pred_12 obj_07 obj_03)
       (pred_12 obj_07 obj_19)
       (pred_12 obj_07 obj_08)
       (pred_12 obj_03 obj_05)
       (pred_12 obj_03 obj_01)
       (pred_12 obj_03 obj_07)
       (pred_12 obj_05 obj_13)
       (pred_12 obj_05 obj_03)
       (pred_9 obj_06)
       (pred_9 obj_17)
       (pred_11  obj_06 obj_11)
       (pred_11  obj_17 obj_04)
       (pred_8 obj_20)
       (pred_8 obj_12)
       (pred_8 obj_02)
       (pred_8 obj_10)
       (pred_8 obj_16)
       (pred_8 obj_15)
       (pred_8 obj_09)
       (pred_8 obj_19)
       (pred_8 obj_01)
       (pred_8 obj_13)
       (pred_8 obj_08)
       (pred_8 obj_07)
       (pred_8 obj_03)
       (pred_8 obj_05)

       (pred_5  obj_14 obj_11)
       (pred_5  obj_18 obj_04)
       (pred_6 obj_14 obj_08)
       (pred_6 obj_18 obj_07)
       (pred_10 obj_05)
    )

    (:goal (and
       (pred_6 obj_18 obj_17)
    ))
(:constraints
  (always (not (pred_10 obj_16)))
)
)

; plan
1. (op_1 obj_05 obj_03)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_03)
   goals met: 0 of 1
2. (op_1 obj_03 obj_07)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_07)
   goals met: 0 of 1
3. (op_2 obj_07 obj_18)
   deleted: (pred_6 obj_18 obj_07) (pred_4)
   added: (pred_2 obj_18)
   goals met: 0 of 1
4. (op_1 obj_07 obj_19)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_19)
   goals met: 0 of 1
5. (op_1 obj_19 obj_09)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_09)
   goals met: 0 of 1
6. (op_1 obj_09 obj_10)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_10)
   goals met: 0 of 1
7. (op_1 obj_10 obj_20)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_20)
   goals met: 0 of 1
8. (op_3 obj_20 obj_17 obj_18 obj_04)
   deleted: (pred_9 obj_17)
   added: (pred_8 obj_17)
   goals met: 0 of 1
9. (op_1 obj_20 obj_17)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_17)
   goals met: 0 of 1
10. (op_4 obj_17 obj_18)
   deleted: (pred_2 obj_18)
   added: (pred_4) (pred_6 obj_18 obj_17)
   goals met: 1 of 1
